README.org
* _Safety Equipment_ on construction projects.
Tags (squares) were marked using [[https://github.com/tzutalin/labelImg][lableimg]]. 
The output file is the ~.xml~ with the same name as the picture and contains the squares coordinates and tags name.


** Tags:
   - hard hat
   - high-vis

** Scripts
   1) To convert *untaged* images (~jpeg~ or ~png~) to jpg run ~convert_images_to_jpg.py~
   2) Tag ~./images/untaged/~ images and move the ~jpg~ and ~xml~ files to ~./images~.
   3) Sort your data into Training, Testing, and Validating using ~sort.py~. The script is set to split the data in 90%, 5%, and 5%.
   4) To convert ~.xml~ to ~.csv~ use ~convert_images_to_jpg.py~ (from [[https://github.com/datitran/raccoon_dataset][raccoon]]).




